# --- Messages text ---
STARTUP_TEXT = \
    'Бот позволяет делать крутой дизайн слайдов для Wildberries.\n' \
    '1. Выбираешь дизайн для слайдов, который тебе понравится\n' \
    '2. В боте примеряешь свой товар на главную карточку\n' \
    '3. Скидываешь дизайнеру фото, текст и свои пожелания\n' \
    '4. Получаешь крутой дизайн меньше чем за 24 часа!'

GREETING_USER_TEXT = \
    'Привет, {}! Добро пожаловать в чат бот для создания инфографики!' \
    'Чтобы быстро понять как тут все устроено, посмотри короткую инструкцию 👇'

DESIGN_STARTUP_TEXT = 'Выбери понравившийся дизайн и посмотри главный слайд с фотографиями своего товара!'

DESIGN_DESCRIPTION_TEXT = \
    'Код товара: {0}\n' \
    'Цена: {1} руб. за 1 слайд\n' \
    'Доп. информация: Наполнением слайдов занимается дизайнер. Вы можете разместить любую информацию ' \
    'в рамках данного дизайна и заказать дополнительные слайды'

HELP_STARTUP_TEXT = \
    'Главная видеоинструкция 👇'

HELP_WARNING_TEXT = \
    'ВАЖНО!!! Мы подобрали для тебя все возможные сценарии слайдов.' \
    'Каждый сценарий можно добавить к выбранным слайдам 👇'

HELP_DESCRIPTION_TEXT = \
    'Название: {0}\n' \
    'Описание {1}'

NO_FAVORITE_MESSAGE = 'Вы еще не сохранили шаблоны'


# --- Buttons text ---
INLINE_OVERVIEW_BUTTON_TEXT = 'Посмотреть с моим товаром'
INLINE_ORDER_BUTTON_TEXT = 'Заказать'
INLINE_TO_FAVORITE_BUTTON_TEXT = 'В избранное'
INLINE_NEXT_DESIGN_BUTTON_TEXT = 'Следующий дизайн ➡'
INLINE_NEXT_BUTTON_TEXT = '➡'
INLINE_PREV_BUTTON_TEXT = '⬅'
INLINE_TO_START_BUTTON_TEXT = 'В начало ⬆'
INLINE_DELETE_BUTTON_TEXT = 'Удалить'
INLINE_ORDER_DESIGN_BUTTON_TEXT = 'Заказать дизайн'
INLINE_NEXT_SCENARIO_BUTTON_TEXT = 'Следующий сценарий ➡'


# --- URL ---
TUTORIAL_VIDEO_URL = r'../media/videos/tutorial.mp4'
